pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"ಹಿನ್ನೆಲೆಯನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಬೇಕೇ"#####,
    b"base_name" => r#####""ಹೈಲೈಟ್-ಮ್ಯಾಪ್" ನ ಮೂಲ ಹೆಸರು"#####,
    b"bincode_suffix" => r#####"bincode ಫೈಲ್ ಸಫಿಕ್ಸ್"#####,
    b"custom_syntax_set" => r#####"ಕಸ್ಟಮ್ ವಾಕ್ಯರಚನೆ ಸೆಟ್ ಫೈಲ್"#####,
    b"custom_theme_set" => r#####"ಕಸ್ಟಮ್ ಥೀಮ್ ಸೆಟ್ ಫೈಲ್"#####,
    b"display_config_dir" => r#####"Glossa ನ ಕಾನ್ಫಿಗ್ ಡೈರೆಕ್ಟರಿಯನ್ನು ತೋರಿಸಿ"#####,
    b"dsl_suffix" => r#####"DSL ಫೈಲ್ ಸಫಿಕ್ಸ್ (ಡೀಫಾಲ್ಟ್ ".dsl")"#####,
    b"exclude_languages" => r#####"ಬ್ಲ್ಯಾಕ್‌ಲಿಸ್ಟ್ ಮೋಡ್: ಪಟ್ಟಿಯ ಭಾಷಾ ID‌ಗಳನ್ನು ಆರಂಭಿಸಬೇಡಿ"#####,
    b"exclude_map_names" => r#####"ಪಟ್ಟಿಯ ನಕ್ಷೆ ಹೆಸರುಗಳನ್ನು ಆರಂಭಿಸಬೇಡಿ"#####,
    b"include_languages" => r#####"ವೈಟ್‌ಲಿಸ್ಟ್ ಮೋಡ್: ಪಟ್ಟಿಯಲ್ಲಿರುವ ಭಾಷಾ ID‌ಗಳನ್ನು ಮಾತ್ರ ಆರಂಭಿಸಿ"#####,
    b"include_map_names" => r#####"ಪಟ್ಟಿಯಲ್ಲಿರುವ ನಕ್ಷೆ ಹೆಸರುಗಳನ್ನು ಮಾತ್ರ ಆರಂಭಿಸಿ"#####,
    b"input" => r#####"ಸ್ಥಳೀಕರಣ ಸಂಪನ್ಮೂಲಗಳ ಮೂಲ ಡೈರೆಕ್ಟರಿ"#####,
    b"list_all_syntaxes" => r#####"ಎಲ್ಲಾ ವಾಕ್ಯರಚನೆ ಹೆಸರುಗಳು ಮತ್ತು ವಿಸ್ತರಣೆಗಳನ್ನು ತೋರಿಸಿ"#####,
    b"list_all_themes" => r#####"ಎಲ್ಲಾ ಥೀಮ್ ಹೆಸರುಗಳನ್ನು ತೋರಿಸಿ"#####,
    b"mod_prefix" => r#####"mod ಫೈಲ್ ಪ್ರಿಫಿಕ್ಸ್ (ಡೀಫಾಲ್ಟ್ "l10n_")"#####,
    b"outdir" => r#####"ಔಟ್ಪುಟ್ ಡೈರೆಕ್ಟರಿ"#####,
    b"output_bincode" => r#####"ವಿಭಿನ್ನ ಭಾಷೆಗಳಿಗಾಗಿ ಪ್ರತ್ಯೇಕ bincode ಫೈಲ್‌ಗಳನ್ನು ರಚಿಸಿ"#####,
    b"output_bincode_all_in_one" => {
      r#####"ಎಲ್ಲಾ ಭಾಷೆಗಳ bincode‌ಗಳನ್ನು ಒಂದೇ ಫೈಲ್‌ಗೆ ರವಾನಿಸಿ"#####
    }
    b"output_locales_fn" => r#####"all_locales ಫಂಕ್ಷನ್ ಅನ್ನು ರವಾನಿಸಿ"#####,
    b"output_match_fn" => r#####"ರಸ್ಟ್ ಕೋಡ್ ಫೈಲ್‌ಗಳನ್ನು ರಚಿಸಿ (match ಎಕ್ಸ್‌ಪ್ರೆಶನ್‌ಗಳೊಂದಿಗೆ)"#####,
    b"output_match_fn_all_in_one" => {
      r#####"ಎಲ್ಲಾ ಡೇಟಾವನ್ನು ಒಂದೇ match ಫಂಕ್ಷನ್‌ಗೆ ರವಾನಿಸಿ (ಸ್ಟ್ರಿಂಗ್)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"ಭಾಷಾ ಹೆಸರನ್ನು ಕೀ ಆಗಿ ಬಳಸುವ match ಫಂಕ್ಷನ್"#####
    }
    b"output_match_fn_all_in_one_without_map_name" => {
      r#####"ಸಂಯುಕ್ತ ಕೀ (ಭಾಷೆ+map_key) ಯೊಂದಿಗೆ match ಫಂಕ್ಷನ್"#####
    }
    b"output_match_fn_without_map_name" => {
      r#####"map_key ಮಾತ್ರ ಕೀ ಆಗಿ ಬಳಸಿ (map_name ಬಳಸಬೇಡಿ)"#####
    }
    b"output_phf" => r#####"ವಿಭಿನ್ನ ಭಾಷೆಗಳಿಗಾಗಿ ಪ್ರತ್ಯೇಕ phf map ಫಂಕ್ಷನ್‌ಗಳನ್ನು ರಚಿಸಿ"#####,
    b"output_phf_all_in_one" => r#####"ಎಲ್ಲಾ phf map‌ಗಳನ್ನು ಒಂದೇ ಫಂಕ್ಷನ್‌ಗೆ ಸಂಯೋಜಿಸಿ"#####,
    b"output_phf_without_map_name" => {
      r#####"ಸಾಮಾನ್ಯ ಸ್ಟ್ರಿಂಗ್ ಕೀ‌ಗಳೊಂದಿಗೆ phf map (TupleKey ಅಲ್ಲ)"#####
    }
    b"output_ron" => r#####"RON ಫಾರ್ಮ್ಯಾಟ್‌ನಲ್ಲಿ ಸ್ಟ್ರಿಂಗ್ ಅನ್ನು ರವಾನಿಸಿ"#####,
    b"suffix" => r#####""ಹೈಲೈಟ್-ಮ್ಯಾಪ್" ನ ಹೊಸ ಸಫಿಕ್ಸ್"#####,
    b"syntax_name" => r#####"ವಾಕ್ಯರಚನೆಯ ಹೆಸರು"#####,
    b"theme_name" => r#####"ಥೀಮ್ ಹೆಸರು"#####,
    b"true_color" => r#####"24-ಬಿಟ್ ನಿಜವಾದ ಬಣ್ಣ"#####,
    b"visibility" => r#####"ರಚಿಸಲಾದ ಕೋಡ್‌ನ ಗೋಚರತೆ"#####,
    _ => "",
  }
}
