pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"पृष्ठभूमि सक्रिय करें"#####,
    b"base_name" => r#####""हाइलाइट-मैप" का मूल नाम"#####,
    b"bincode_suffix" => r#####"bincode फ़ाइल प्रत्यय"#####,
    b"custom_syntax_set" => r#####"कस्टम वाक्यविन्यास सेट फ़ाइल"#####,
    b"custom_theme_set" => r#####"कस्टम थीम सेट फ़ाइल"#####,
    b"display_config_dir" => r#####"ग्लोसा कॉन्फ़िग डायरेक्टरी दिखाएं"#####,
    b"dsl_suffix" => r#####"DSL फ़ाइल प्रत्यय (डिफ़ॉल्ट ".dsl")"#####,
    b"exclude_languages" => r#####"काली सूची मोड: सूची में मौजूद भाषा ID सक्रिय न करें"#####,
    b"exclude_map_names" => r#####"सूची में मौजूद मैप नाम सक्रिय न करें"#####,
    b"include_languages" => {
      r#####"सफेद सूची मोड: केवल सूची में मौजूद भाषा ID सक्रिय करें"#####
    }
    b"include_map_names" => r#####"केवल सूची में मौजूद मैप नाम सक्रिय करें"#####,
    b"input" => r#####"स्थानीयकरण संसाधनों का स्रोत डायरेक्टरी"#####,
    b"list_all_syntaxes" => r#####"सभी वाक्यविन्यास नाम और एक्सटेंशन दिखाएं"#####,
    b"list_all_themes" => r#####"सभी थीम नाम दिखाएं"#####,
    b"mod_prefix" => r#####"mod फ़ाइल उपसर्ग (डिफ़ॉल्ट "l10n_")"#####,
    b"outdir" => r#####"आउटपुट डायरेक्टरी"#####,
    b"output_bincode" => r#####"अलग-अलग भाषाओं के लिए स्वतंत्र bincode फ़ाइलें बनाएं"#####,
    b"output_bincode_all_in_one" => {
      r#####"सभी भाषाओं के bincode एक फ़ाइल में निर्यात करें"#####
    }
    b"output_locales_fn" => r#####"all_locales फ़ंक्शन निर्यात करें"#####,
    b"output_match_fn" => r#####"रस्ट कोड फ़ाइलें (match एक्सप्रेशन वाले फ़ंक्शन) बनाएं"#####,
    b"output_match_fn_all_in_one" => {
      r#####"सभी डेटा को एक match फ़ंक्शन में निर्यात करें (स्ट्रिंग)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"भाषा नाम को कुंजी के रूप में प्रयोग करने वाला match फ़ंक्शन"#####
    }
    b"output_match_fn_all_in_one_by_language_and_key" => {
      r#####"संयुक्त कुंजी (भाषा+map_key) वाला match फ़ंक्शन"#####
    }
    b"output_match_fn_by_key" => {
      r#####"केवल map_key को कुंजी के रूप में प्रयोग करें (map_name नहीं)"#####
    }
    b"output_phf" => r#####"भाषा-विशिष्ट phf मैप फ़ंक्शन बनाएं"#####,
    b"output_phf_all_in_one" => r#####"सभी phf मैप्स को एक फ़ंक्शन में संयोजित करें"#####,
    b"output_phf_by_key" => r#####"सामान्य स्ट्रिंग कुंजी वाले phf मैप (TupleKey नहीं)"#####,
    b"output_ron" => r#####"RON प्रारूप में स्ट्रिंग निर्यात करें"#####,
    b"suffix" => r#####""हाइलाइट-मैप" का नया प्रत्यय"#####,
    b"syntax_name" => r#####"वाक्यविन्यास नाम"#####,
    b"theme_name" => r#####"विषय नाम"#####,
    b"true_color" => r#####"24-बिट सही रंग"#####,
    b"visibility" => r#####"बनाया गया कोड दृश्यता"#####,
    _ => "",
  }
}
