pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"تەگلىكنى ئاكتىپلاشتۇرۇش"#####,
    b"base_name" => r#####""Highlight-Map" نىڭ ئاساسىي ئىسمى"#####,
    b"bincode_suffix" => r#####"bincode ھۆججەت كېڭەيتمىسى"#####,
    b"custom_syntax_set" => r#####"خاس سىنتاكس توپلىمى ھۆججىتى"#####,
    b"custom_theme_set" => r#####"خاس تېما توپلىمى ھۆججىتى"#####,
    b"display_config_dir" => r#####"glossa سەپلىمىسى مۇندەرىجىسىنى كۆرسىتىش"#####,
    b"dsl_suffix" => r#####"DSL ھۆججەت كېڭەيتمىسى (سۈكۈتتىكى ".dsl")"#####,
    b"exclude_languages" => {
      r#####"قارا تىزىم ھالىتى: تىزىمدىكى تىل ID لىرىنى ئىنىتسىيالىمىسۇن"#####
    }
    b"exclude_map_names" => r#####"تىزىمدىكى خەرىتە ئىملىرىنى ئىنىتسىيالىمىسۇن"#####,
    b"include_languages" => {
      r#####"ئاق تىزىم ھالىتى: تىزىمدىكى تىل ID لىرىنىلا ئىنىتسىيالا"#####
    }
    b"include_map_names" => r#####"تىزىمدىكى خەرىتە ئىملىرىنىلا ئىنىتسىيالا"#####,
    b"input" => r#####"يەرلىكلەشكەن مەنبەلەرنىڭ ئەسلى مۇندەرىجىسى"#####,
    b"list_all_syntaxes" => {
      r#####"بارلىق سىنتاكس ئىملىرى ۋە كېڭەيتىلمىلىرىنى كۆرسىتىش"#####
    }
    b"list_all_themes" => r#####"بارلىق تېما ئىملىرىنى كۆرسىتىش"#####,
    b"mod_prefix" => r#####"mod ھۆججەت ئالدىقى (سۈكۈتتىكى "l10n_")"#####,
    b"outdir" => r#####"چىقىرىش مۇندەرىجىسى"#####,
    b"output_bincode" => {
      r#####"تۈرلۈك تىللار ئۈچۈن ئايرىم bincode ھۆججەتلىرىنى ھاسىل قىلىش"#####
    }
    b"output_bincode_all_in_one" => {
      r#####"بارلىق تىللارنىڭ bincode نى بىر ھۆججەتكە چىقىرىش"#####
    }
    b"output_locales_fn" => r#####"all_locales فونكسىيەسىنى چىقىرىش"#####,
    b"output_match_fn" => {
      r#####"match ئىپادىلىك فونكسىيىلىك Rust كود ھۆججەتلىرىنى ھاسىل قىلىش"#####
    }
    b"output_match_fn_all_in_one" => {
      r#####"بارلىق سانلىق مەلۇماتنى بىر match فونكسىيىگە چىقىرىش (تېمىس)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"تىل ئىسمى كۇنۇپكا بولغان بىر match فونكسىيە"#####
    }
    b"output_match_fn_all_in_one_by_language_and_key" => {
      r#####"بىرلەشكەن كۇنۇپكا (تىل+map_key) بىلەن match فونكسىيە"#####
    }
    b"output_match_fn_by_key" => {
      r#####"پەقەت map_key نى كۇنۇپكا قىلىپ (map_name يوق)"#####
    }
    b"output_phf" => {
      r#####"تىللار ئۈچۈن ئايرىم phf خەرىتىلىك فونكسىيە ھاسىل قىلىش"#####
    }
    b"output_phf_all_in_one" => {
      r#####"بارلىق phf خەرىتىلەرنى بىر فونكسىيەگە چىقىرىش"#####
    }
    b"output_phf_by_key" => {
      r#####"ئادەتتىكى تېمىس كۇنۇپكىسى بىلەن phf خەرىتە (TupleKey ئەمەس)"#####
    }
    b"output_ron" => r#####"RON فورماتىدىكى تېمىسنى چىقىرىش"#####,
    b"suffix" => r#####""Highlight-Map" نىڭ يېڭى كېڭەيتمىسى"#####,
    b"syntax_name" => r#####"سىنتاكس ئىسمى"#####,
    b"theme_name" => r#####"تېما ئىسمى"#####,
    b"true_color" => r#####"24-بىتلىق ھەقىقىي رەڭ"#####,
    b"visibility" => r#####"ھاسىل قىلىنغان كودنىڭ كۆرۈنۈشچانلىقى"#####,
    _ => "",
  }
}
