pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"బ్యాక్‌గ్రౌండ్ ప్రారంభించాలా"#####,
    b"base_name" => r#####""హైలైట్-మ్యాప్" బేస్ పేరు"#####,
    b"bincode_suffix" => r#####"bincode ఫైల్ సఫిక్స్"#####,
    b"custom_syntax_set" => r#####"కస్టమ్ సింటాక్స్ సెట్ ఫైల్"#####,
    b"custom_theme_set" => r#####"కస్టమ్ థీమ్ సెట్ ఫైల్"#####,
    b"display_config_dir" => r#####"గ్లోసా కాన్ఫిగ్ డైరెక్టరీని చూపించు"#####,
    b"dsl_suffix" => r#####"DSL ఫైల్ సఫిక్స్ (డిఫాల్ట్ ".dsl")"#####,
    b"exclude_languages" => r#####"బ్లాక్‌లిస్ట్ మోడ్: జాబితా భాష IDలను ప్రారంభించవద్దు"#####,
    b"exclude_map_names" => r#####"జాబితా మ్యాప్ పేర్లను ప్రారంభించవద్దు"#####,
    b"include_languages" => r#####"వైట్‌లిస్ట్ మోడ్: జాబితాలోని భాష IDలను మాత్రమే ప్రారంభించు"#####,
    b"include_map_names" => r#####"జాబితాలోని మ్యాప్ పేర్లను మాత్రమే ప్రారంభించు"#####,
    b"input" => r#####"స్థానికీకరణ వనరుల మూల డైరెక్టరీ"#####,
    b"list_all_syntaxes" => r#####"అన్ని సింటాక్స్ పేర్లు మరియు ఎక్స్‌టెన్షన్‌లను చూపించు"#####,
    b"list_all_themes" => r#####"అన్ని థీమ్ పేర్లను చూపించు"#####,
    b"mod_prefix" => r#####"mod ఫైల్ ప్రిఫిక్స్ (డిఫాల్ట్ "l10n_")"#####,
    b"outdir" => r#####"అవుట్పుట్ డైరెక్టరీ"#####,
    b"output_bincode" => r#####"వివిధ భాషలకు స్వతంత్ర bincode ఫైళ్ళను సృష్టించు"#####,
    b"output_bincode_all_in_one" => r#####"అన్ని భాషల bincodeలను ఒకే ఫైల్‌లో ఎగుమతి చేయి"#####,
    b"output_locales_fn" => r#####"all_locales ఫంక్షన్‌ను ఎగుమతి చేయి"#####,
    b"output_match_fn" => r#####"రస్ట్ కోడ్ ఫైళ్ళను సృష్టించు (match ఎక్స్‌ప్రెషన్ ఫంక్షన్‌లతో)"#####,
    b"output_match_fn_all_in_one" => {
      r#####"అన్ని డేటాను ఒక match ఫంక్షన్‌లో ఎగుమతి చేయి (స్ట్రింగ్)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"భాష పేరును కీగా ఉపయోగించే match ఫంక్షన్"#####
    }
    b"output_match_fn_all_in_one_without_map_name" => {
      r#####"కాంబైన్డ్ కీ (భాష+map_key) తో match ఫంక్షన్"#####
    }
    b"output_match_fn_without_map_name" => {
      r#####"map_keyని మాత్రమే కీగా ఉపయోగించు (map_name లేదు)"#####
    }
    b"output_phf" => r#####"భిన్న భాషలకు స్వతంత్ర phf మ్యాప్ ఫంక్షన్‌లు"#####,
    b"output_phf_all_in_one" => r#####"అన్ని phf మ్యాప్‌లను ఒక ఫంక్షన్‌లో కలుపు"#####,
    b"output_phf_without_map_name" => r#####"సాధారణ స్ట్రింగ్ కీలతో phf మ్యాప్ (TupleKey కాదు)"#####,
    b"output_ron" => r#####"RON ఫార్మాట్‌లో స్ట్రింగ్ ఎగుమతి చేయి"#####,
    b"suffix" => r#####""హైలైట్-మ్యాప్" కొత్త సఫిక్స్"#####,
    b"syntax_name" => r#####"సింటాక్స్ పేరు"#####,
    b"theme_name" => r#####"థీమ్ పేరు"#####,
    b"true_color" => r#####"24-బిట్ నిజమైన రంగు"#####,
    b"visibility" => r#####"జనరేట్ చేసిన కోడ్ దృశ్యమానత"#####,
    _ => "",
  }
}
