pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"पृष्ठभूमि सक्षम करें"#####,
    b"base_name" => r#####""हाइलाइट-मैप" का आधार नाम"#####,
    b"bincode_suffix" => r#####"bincode फ़ाइल एक्सटेंशन"#####,
    b"custom_syntax_set" => r#####"कस्टम सिंटैक्स सेट फ़ाइल"#####,
    b"custom_theme_set" => r#####"कस्टम थीम सेट फ़ाइल"#####,
    b"display_config_dir" => r#####"glossa कॉन्फ़िग निर्देशिका प्रदर्शित करें"#####,
    b"dsl_suffix" => r#####"DSL फ़ाइल एक्सटेंशन (डिफ़ॉल्ट ".dsl")"#####,
    b"exclude_languages" => {
      r#####"ब्लैकलिस्ट मोड: सूची में उपस्थित भाषा ID प्रारंभ न करें"#####
    }
    b"exclude_map_names" => r#####"सूची में उपस्थित मैप नाम प्रारंभ न करें"#####,
    b"include_languages" => {
      r#####"व्हाइटलिस्ट मोड: केवल सूची में उपस्थित भाषा ID प्रारंभ करें"#####
    }
    b"include_map_names" => r#####"केवल सूची में उपस्थित मैप नाम प्रारंभ करें"#####,
    b"input" => r#####"स्थानीयकरण संसाधनों का स्रोत निर्देशिका"#####,
    b"list_all_syntaxes" => r#####"सभी सिंटैक्स नाम और एक्सटेंशन प्रदर्शित करें"#####,
    b"list_all_themes" => r#####"सभी थीम नाम प्रदर्शित करें"#####,
    b"mod_prefix" => r#####"mod फ़ाइल प्रीफ़िक्स (डिफ़ॉल्ट "l10n_")"#####,
    b"outdir" => r#####"आउटपुट निर्देशिका"#####,
    b"output_bincode" => {
      r#####"विभिन्न भाषाओं के लिए अलग-अलग bincode फ़ाइलें जनरेट करें"#####
    }
    b"output_bincode_all_in_one" => {
      r#####"सभी भाषाओं के bincode एक फ़ाइल में एक्सपोर्ट करें"#####
    }
    b"output_locales_fn" => r#####"all_locales फ़ंक्शन एक्सपोर्ट करें"#####,
    b"output_match_fn" => r#####"रस्ट कोड फ़ाइलें जनरेट करें (match एक्सप्रेशन वाले फ़ंक्शन)"#####,
    b"output_match_fn_all_in_one" => {
      r#####"सभी डेटा को एक match फ़ंक्शन में एक्सपोर्ट करें (स्ट्रिंग)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"भाषा नाम कुंजी के रूप में वाला match फ़ंक्शन"#####
    }
    b"output_match_fn_all_in_one_without_map_name" => {
      r#####"संयुक्त कुंजी (भाषा+map_key) वाला match फ़ंक्शन"#####
    }
    b"output_match_fn_without_map_name" => {
      r#####"केवल map_key को कुंजी के रूप में प्रयोग करें (map_name नहीं)"#####
    }
    b"output_phf" => r#####"विभिन्न भाषाओं के लिए अलग-अलग phf मैप फ़ंक्शन जनरेट करें"#####,
    b"output_phf_all_in_one" => r#####"सभी phf मैप्स को एक फ़ंक्शन में संयोजित करें"#####,
    b"output_phf_without_map_name" => r#####"सामान्य स्ट्रिंग कुंजी वाला phf मैप (TupleKey नहीं)"#####,
    b"output_ron" => r#####"RON फ़ॉर्मेट में स्ट्रिंग एक्सपोर्ट करें"#####,
    b"suffix" => r#####""हाइलाइट-मैप" का नया एक्सटेंशन"#####,
    b"syntax_name" => r#####"सिंटैक्स नाम"#####,
    b"theme_name" => r#####"विषय नाम"#####,
    b"true_color" => r#####"24-बिट ट्रू कलर"#####,
    b"visibility" => r#####"जेनरेटेड कोड की दृश्यता"#####,
    _ => "",
  }
}
