pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"ფონის გააქტიურება"#####,
    b"base_name" => r#####""Highlight-Map"-ის საბაზისო სახელი"#####,
    b"bincode_suffix" => r#####"bincode ფაილის სუფიქსი"#####,
    b"custom_syntax_set" => r#####"მორგებული სინტაქსის კომპლექტის ფაილი"#####,
    b"custom_theme_set" => r#####"მორგებული თემის კომპლექტის ფაილი"#####,
    b"display_config_dir" => {
      r#####"Glossa-ის კონფიგურაციის დირექტორიის ჩვენება"#####
    }
    b"dsl_suffix" => r#####"DSL ფაილის სუფიქსი (ნაგულისხმევი ".dsl")"#####,
    b"exclude_languages" => {
      r#####"შავი სიის რეჟიმი: არ ინიციალიზებდეს სიაში არსებულ ენის ID-ებს"#####
    }
    b"exclude_map_names" => {
      r#####"არ ინიციალიზებდეს სიაში არსებულ რუკის სახელებს"#####
    }
    b"include_languages" => {
      r#####"თეთრი სიის რეჟიმი: ინიციალიზაცია მხოლოდ სიაში არსებული ენის ID-ებით"#####
    }
    b"include_map_names" => {
      r#####"ინიციალიზაცია მხოლოდ სიაში არსებული რუკის სახელებით"#####
    }
    b"input" => r#####"ლოკალიზაციის რესურსების საწყისი დირექტორია"#####,
    b"list_all_syntaxes" => {
      r#####"ყველა სინტაქსის სახელის და გაფართოების ჩვენება"#####
    }
    b"list_all_themes" => r#####"ყველა თემის სახელის ჩვენება"#####,
    b"mod_prefix" => r#####"mod ფაილის პრეფიქსი (ნაგულისხმევი "l10n_")"#####,
    b"outdir" => r#####"გამომავალი დირექტორია"#####,
    b"output_bincode" => {
      r#####"შექმენით ცალკე bincode ფაილები სხვადასხვა ენისთვის"#####
    }
    b"output_bincode_all_in_one" => {
      r#####"ყველა ენის bincode-ების ერთ ფაილში გატანა"#####
    }
    b"output_locales_fn" => r#####"all_locales ფუნქციის გატანა"#####,
    b"output_match_fn" => {
      r#####"შექმენით Rust კოდის ფაილები (match გამოსახულების ფუნქციებით)"#####
    }
    b"output_match_fn_all_in_one" => {
      r#####"ყველა მონაცემის ერთ match ფუნქციაში გატანა (სტრიქონი)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"match ფუნქცია ენის სახელით გასაღებად"#####
    }
    b"output_match_fn_all_in_one_without_map_name" => {
      r#####"match ფუნქცია კომბინირებული გასაღებით (ენა + map_key)"#####
    }
    b"output_match_fn_without_map_name" => {
      r#####"გამოიყენეთ მხოლოდ map_key როგორც გასაღები (map_name-ს გარეშე)"#####
    }
    b"output_phf" => r#####"შექმენით ცალკე phf რუკის ფუნქციები ენებისთვის"#####,
    b"output_phf_all_in_one" => {
      r#####"ყველა phf რუკის ერთ ფუნქციაში გაერთიანება"#####
    }
    b"output_phf_without_map_name" => {
      r#####"phf რუკა ჩვეულებრივი სტრიქონის გასაღებებით (არა TupleKey)"#####
    }
    b"output_ron" => r#####"სტრიქონის გატანა RON ფორმატში"#####,
    b"suffix" => r#####""Highlight-Map"-ის ახალი სუფიქსი"#####,
    b"syntax_name" => r#####"სინტაქსის სახელი"#####,
    b"theme_name" => r#####"თემის სახელი"#####,
    b"true_color" => r#####"24-ბიტიანი ნამდვილი ფერი"#####,
    b"visibility" => r#####"გენერირებული კოდის ხილვადობა"#####,
    _ => "",
  }
}
