pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"पार्श्वभूमी सक्रिय करायची का"#####,
    b"base_name" => r#####"हायलाइट नकाशाचे मूळ नाव"#####,
    b"bincode_suffix" => r#####"बिनकोड फाइल प्रत्यय"#####,
    b"custom_syntax_set" => r#####"सानुकूल सिंटॅक्स संच फाइल"#####,
    b"custom_theme_set" => r#####"सानुकूल थीम संच फाइल"#####,
    b"display_config_dir" => r#####"ग्लोसाची कॉन्फिगरेशन डायरेक्टरी दाखवा"#####,
    b"dsl_suffix" => r#####"DSL फाइल प्रत्यय (पूर्वनिर्धारित ".dsl")"#####,
    b"exclude_languages" => {
      r#####"काळ्या यादी मोड: यादीतील भाषा ID सक्रिय करू नका"#####
    }
    b"exclude_map_names" => r#####"यादीतील नकाशा नावे सक्रिय करू नका"#####,
    b"include_languages" => {
      r#####"पांढर्या यादी मोड: फक्त यादीतील भाषा ID सक्रिय करा"#####
    }
    b"include_map_names" => r#####"फक्त यादीतील नकाशा नावे सक्रिय करा"#####,
    b"input" => r#####"स्थानिक संसाधनांची स्त्रोत डायरेक्टरी"#####,
    b"list_all_syntaxes" => r#####"सर्व सिंटॅक्स नावे आणि विस्तार दाखवा"#####,
    b"list_all_themes" => r#####"सर्व थीम नावे दाखवा"#####,
    b"mod_prefix" => r#####"मॉड फाइल उपसर्ग (पूर्वनिर्धारित "l10n_")"#####,
    b"outdir" => r#####"आउटपुट डायरेक्टरी"#####,
    b"output_bincode" => r#####"विविध भाषांसाठी स्वतंत्र बिनकोड फाइल्स निर्माण करा"#####,
    b"output_bincode_all_in_one" => {
      r#####"सर्व भाषांचे बिनकोड एकाच फाइलमध्ये निर्यात करा"#####
    }
    b"output_locales_fn" => r#####"all_locales फंक्शन निर्यात करा"#####,
    b"output_match_fn" => r#####"मॅच एक्स्प्रेशन असलेल्या रस्ट फाइल्स निर्माण करा"#####,
    b"output_match_fn_all_in_one" => {
      r#####"सर्व डेटा एकाच मॅच फंक्शनमध्ये निर्यात करा (स्ट्रिंग)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"भाषानाव की असलेले एकीकृत मॅच फंक्शन"#####
    }
    b"output_match_fn_all_in_one_without_map_name" => {
      r#####"संयुक्त की (भाषा+map_key) असलेले मॅच फंक्शन"#####
    }
    b"output_match_fn_without_map_name" => {
      r#####"फक्त map_key की म्हणून वापरा (map_name वगळा)"#####
    }
    b"output_phf" => r#####"भाषानुसार स्वतंत्र phf नकाशे निर्माण करा"#####,
    b"output_phf_all_in_one" => r#####"सर्व phf नकाशे एकाच फंक्शनमध्ये समाविष्ट करा"#####,
    b"output_phf_without_map_name" => r#####"सामान्य स्ट्रिंग की असलेली phf नकाशे (टपलकी नाही)"#####,
    b"output_ron" => r#####"RON फॉरमॅटमध्ये स्ट्रिंग निर्यात करा"#####,
    b"suffix" => r#####"नवीन हायलाइट नकाशाचा प्रत्यय"#####,
    b"syntax_name" => r#####"सिंटॅक्स नाव"#####,
    b"theme_name" => r#####"थीम नाव"#####,
    b"true_color" => r#####"24-बिट वास्तविक रंग"#####,
    b"visibility" => r#####"निर्मित कोडची दृश्यमानता"#####,
    _ => "",
  }
}
