pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"နောက်ခံကို ဖွင့်ရန်"#####,
    b"base_name" => r#####"အခြေခံ "Highlight-Map" ၏ အမည်"#####,
    b"bincode_suffix" => r#####"bincode ဖိုင်အဆုံးသတ်"#####,
    b"custom_syntax_set" => r#####"စိတ်ကြိုက်သဒ္ဒါစုစည်းမှုဖိုင်"#####,
    b"custom_theme_set" => r#####"စိတ်ကြိုက်အကြောင်းအရာစုစည်းမှုဖိုင်"#####,
    b"display_config_dir" => r#####"glossa ၏ ပြင်ဆင်မှုဖိုင်တွဲကို ပြသပါ"#####,
    b"dsl_suffix" => r#####"DSL ဖိုင်အဆုံးသတ် (ပုံသေ ".dsl")"#####,
    b"exclude_languages" => r#####"အမဲစာရင်းမုဒ်: စာရင်းထဲရှိ ဘာသာစကား ID များကို မစတင်ပါ"#####,
    b"exclude_map_names" => r#####"စာရင်းထဲရှိ မြေပုံအမည်များကို မစတင်ပါ"#####,
    b"include_languages" => {
      r#####"အဖြူစာရင်းမုဒ်: စာရင်းထဲရှိ ဘာသာစကား ID များကိုသာ အစပြုပါ"#####
    }
    b"include_map_names" => r#####"စာရင်းထဲရှိ မြေပုံအမည်များကိုသာ အစပြုပါ"#####,
    b"input" => r#####"ဒေသခံအရင်းအမြစ်များ၏ မူလဖိုင်တွဲ"#####,
    b"list_all_syntaxes" => r#####"သဒ္ဒါအမည်များနှင့် ချဲ့ထွင်မှုများအားလုံးကို ပြသပါ"#####,
    b"list_all_themes" => r#####"အကြောင်းအရာအမည်အားလုံးကို ပြသပါ"#####,
    b"mod_prefix" => r#####"mod ဖိုင်ရှေ့ဆက် (ပုံသေ "l10n_")"#####,
    b"outdir" => r#####"ထုတ်လုပ်သည့်ဖိုင်တွဲ"#####,
    b"output_bincode" => r#####"ဘာသာစကားအမျိုးမျိုးအတွက် သီးသန့် bincode ဖိုင်များ ထုတ်လုပ်ပါ"#####,
    b"output_bincode_all_in_one" => {
      r#####"ဘာသာစကားအားလုံး၏ bincode များကို ဖိုင်တစ်ခုတည်းသို့ ထုတ်ပါ"#####
    }
    b"output_locales_fn" => r#####"all_locales လုပ်ဆောင်ချက်ကို ထုတ်ပါ"#####,
    b"output_match_fn" => r#####"match ဖော်ပြချက်ပါသော Rust ကုဒ်ဖိုင်များ ထုတ်လုပ်ပါ"#####,
    b"output_match_fn_all_in_one" => {
      r#####"ဒေတာအားလုံးကို match လုပ်ဆောင်ချက်တစ်ခုအဖြစ် ထုတ်ပါ (စာတန်း)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"ဘာသာစကားအမည်ကို သော့ချက်အဖြစ်ပါသော match လုပ်ဆောင်ချက်"#####
    }
    b"output_match_fn_all_in_one_without_map_name" => {
      r#####"ဘာသာစကားအမည် + map_key ပေါင်းစပ်သော့ပါသော match လုပ်ဆောင်ချက်"#####
    }
    b"output_match_fn_without_map_name" => {
      r#####"map_key ကိုသာ သော့ချက်အဖြစ် အသုံးပြုပါ (map_name မပါဝင်)"#####
    }
    b"output_phf" => r#####"ဘာသာစကားအလိုက် phf မြေပုံလုပ်ဆောင်ချက်များ ထုတ်လုပ်ပါ"#####,
    b"output_phf_all_in_one" => r#####"phf မြေပုံအားလုံးကို လုပ်ဆောင်ချက်တစ်ခုတည်းသို့ ထုတ်ပါ"#####,
    b"output_phf_without_map_name" => {
      r#####"သာမန်စာတန်းသော့များပါသော phf မြေပုံများ (TupleKey မဟုတ်)"#####
    }
    b"output_ron" => r#####"RON ဖော်မတ်ဖြင့် စာတန်းထုတ်ပါ"#####,
    b"suffix" => r#####"အသစ်ထုတ်လုပ်သော "Highlight-Map" ၏ အဆုံးသတ်"#####,
    b"syntax_name" => r#####"သဒ္ဒါအမည်"#####,
    b"theme_name" => r#####"အကြောင်းအရာအမည်"#####,
    b"true_color" => r#####"24-bit အစစ်အမှန်အရောင်"#####,
    b"visibility" => r#####"ထုတ်လုပ်ထားသော ကုဒ်၏ မြင်နိုင်မှု"#####,
    _ => "",
  }
}
