pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"Ενεργοποίηση υποβάθρου"#####,
    b"base_name" => r#####"Βασικό όνομα "Highlight-Map""#####,
    b"bincode_suffix" => r#####"Επίθημα αρχείου bincode"#####,
    b"custom_syntax_set" => r#####"Προσαρμοσμένο αρχείο συντακτικών ρυθμίσεων"#####,
    b"custom_theme_set" => r#####"Προσαρμοσμένο αρχείο θεματικών ρυθμίσεων"#####,
    b"display_config_dir" => r#####"Εμφάνιση καταλόγου ρυθμίσεων glossa"#####,
    b"dsl_suffix" => r#####"Επίθημα αρχείου DSL (προεπιλογή ".dsl")"#####,
    b"exclude_languages" => {
      r#####"Λειτουργία μαύρης λίστας: Αποκλεισμός εγγεγραμμένων γλωσσών"#####
    }
    b"exclude_map_names" => r#####"Αποκλεισμός εγγεγραμμένων ονομάτων χαρτών"#####,
    b"include_languages" => {
      r#####"Λειτουργία λευκής λίστας: Αρχικοποίηση μόνο εγγεγραμμένων γλωσσών"#####
    }
    b"include_map_names" => {
      r#####"Αρχικοποίηση μόνο εγγεγραμμένων ονομάτων χαρτών"#####
    }
    b"input" => r#####"Πηγαίος κατάλογος τοπικών πόρων"#####,
    b"list_all_syntaxes" => {
      r#####"Εμφάνιση όλων συντακτικών ονομάτων και επεκτάσεων"#####
    }
    b"list_all_themes" => r#####"Εμφάνιση όλων ονομάτων θεμάτων"#####,
    b"mod_prefix" => r#####"Πρόθεμα αρχείου mod (προεπιλογή "l10n_")"#####,
    b"outdir" => r#####"Κατάλογος εξόδου"#####,
    b"output_bincode" => {
      r#####"Δημιουργία ανεξάρτητων αρχείων bincode ανά γλώσσα"#####
    }
    b"output_bincode_all_in_one" => {
      r#####"Εξαγωγή όλων των bincode σε ενιαίο αρχείο"#####
    }
    b"output_locales_fn" => r#####"Εξαγωγή συνάρτησης all_locales"#####,
    b"output_match_fn" => {
      r#####"Δημιουργία Rust αρχείων με συναρτήσεις match ανά γλώσσα"#####
    }
    b"output_match_fn_all_in_one" => {
      r#####"Ενοποίηση δεδομένων σε μία συνάρτηση match (συμβολοσειρά)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"Συνάρτηση match με όνομα γλώσσας ως κλειδί"#####
    }
    b"output_match_fn_all_in_one_by_language_and_key" => {
      r#####"Συνάρτηση match με σύνθετο κλειδί (γλώσσα + map_key)"#####
    }
    b"output_match_fn_by_key" => {
      r#####"Χρήση μόνο map_key ως κλειδί (χωρίς map_name)"#####
    }
    b"output_phf" => {
      r#####"Δημιουργία ανεξάρτητων phf map συναρτήσεων ανά γλώσσα"#####
    }
    b"output_phf_all_in_one" => {
      r#####"Ενοποίηση όλων των phf map σε μία συνάρτηση"#####
    }
    b"output_phf_by_key" => {
      r#####"phf map με απλές συμβολοσειρές κλειδιών (όχι TupleKey)"#####
    }
    b"output_ron" => r#####"Εξαγωγή συμβολοσειράς σε μορφή RON"#####,
    b"suffix" => r#####"Επίθημα νέου "Highlight-Map""#####,
    b"syntax_name" => r#####"Όνομα σύνταξης"#####,
    b"theme_name" => r#####"Όνομα θέματος"#####,
    b"true_color" => r#####"Αληθινό χρώμα 24-bit"#####,
    b"visibility" => r#####"Ορατότητα δημιουργημένου κώδικα"#####,
    _ => "",
  }
}
