pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"ପୃଷ୍ଠଭୂମି ସକ୍ରିୟ କରନ୍ତୁ"#####,
    b"base_name" => r#####""ହାଇଲାଇଟ-ମ୍ୟାପ୍" ର ମୂଳ ନାମ"#####,
    b"bincode_suffix" => r#####"bincode ଫାଇଲ୍ ସଫିକ୍ସ"#####,
    b"custom_syntax_set" => r#####"କଷ୍ଟମ୍ ସିଣ୍ଟାକ୍ସ ସେଟ୍ ଫାଇଲ୍"#####,
    b"custom_theme_set" => r#####"କଷ୍ଟମ୍ ଥିମ୍ ସେଟ୍ ଫାଇଲ୍"#####,
    b"display_config_dir" => r#####"Glossa ର କଂଫିଗ୍ ଡାଇରେକ୍ଟରୀ ଦେଖାନ୍ତୁ"#####,
    b"dsl_suffix" => r#####"DSL ଫାଇଲ୍ ସଫିକ୍ସ (ଡିଫଲ୍ଟ ".dsl")"#####,
    b"exclude_languages" => {
      r#####"କଳା ତାଲିକା ମୋଡ୍: ତାଲିକାରେ ଥିବା ଭାଷା ID ଗୁଡିକୁ ଇନିସିଆଲାଇଜ୍ କରନ୍ତୁ ନାହିଁ"#####
    }
    b"exclude_map_names" => r#####"ତାଲିକାରେ ଥିବା ମ୍ୟାପ୍ ନାମଗୁଡିକୁ ଇନିସିଆଲାଇଜ୍ କରନ୍ତୁ ନାହିଁ"#####,
    b"include_languages" => {
      r#####"ଧଳା ତାଲିକା ମୋଡ୍: ତାଲିକାରେ ଥିବା ଭାଷା ID ଗୁଡିକୁ କେବଳ ଇନିସିଆଲାଇଜ୍ କରନ୍ତୁ"#####
    }
    b"include_map_names" => r#####"ତାଲିକାରେ ଥିବା ମ୍ୟାପ୍ ନାମଗୁଡିକୁ କେବଳ ଇନିସିଆଲାଇଜ୍ କରନ୍ତୁ"#####,
    b"input" => r#####"ଲୋକାଲାଇଜେସନ୍ ସ୍ରୋତ ଡାଇରେକ୍ଟରୀ"#####,
    b"list_all_syntaxes" => r#####"ସମସ୍ତ ସିଣ୍ଟାକ୍ସ ନାମ ଏବଂ ଏକ୍ସଟେନ୍ସନ୍ ଦେଖାନ୍ତୁ"#####,
    b"list_all_themes" => r#####"ସମସ୍ତ ଥିମ୍ ନାମ ଦେଖାନ୍ତୁ"#####,
    b"mod_prefix" => r#####"mod ଫାଇଲ୍ ପ୍ରିଫିକ୍ସ (ଡିଫଲ୍ଟ "l10n_")"#####,
    b"outdir" => r#####"ଆଉଟପୁଟ ଡାଇରେକ୍ଟରୀ"#####,
    b"output_bincode" => r#####"ବିଭିନ୍ନ ଭାଷା ପାଇଁ ସ୍ୱତନ୍ତ୍ର bincode ଫାଇଲ୍ ସୃଷ୍ଟି କରନ୍ତୁ"#####,
    b"output_bincode_all_in_one" => {
      r#####"ସମସ୍ତ ଭାଷାର bincode ଗୁଡିକୁ ଗୋଟିଏ ଫାଇଲ୍ରେ ଏକ୍ସପୋର୍ଟ କରନ୍ତୁ"#####
    }
    b"output_locales_fn" => r#####"all_locales ଫଙ୍କସନ୍ ଏକ୍ସପୋର୍ଟ କରନ୍ତୁ"#####,
    b"output_match_fn" => r#####"ରଷ୍ଟ କୋଡ୍ ଫାଇଲ୍ ସୃଷ୍ଟି କରନ୍ତୁ (match ଏକ୍ସପ୍ରେସନ୍ ସହିତ)"#####,
    b"output_match_fn_all_in_one" => {
      r#####"ସମସ୍ତ ଡାଟା ଗୋଟିଏ match ଫଙ୍କସନ୍ରେ ଏକ୍ସପୋର୍ଟ କରନ୍ତୁ (ଷ୍ଟ୍ରିଂ)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"ଭାଷା ନାମକୁ କୀ ଭାବରେ ବ୍ୟବହାର କରୁଥିବା match ଫଙ୍କସନ୍"#####
    }
    b"output_match_fn_all_in_one_without_map_name" => {
      r#####"କମ୍ବାଇନ୍ କୀ (ଭାଷା+map_key) ସହିତ match ଫଙ୍କସନ୍"#####
    }
    b"output_match_fn_without_map_name" => {
      r#####"କେବଳ map_key କୁ କୀ ଭାବରେ ବ୍ୟବହାର କରନ୍ତୁ (map_name ନୁହେଁ)"#####
    }
    b"output_phf" => r#####"ଭିନ୍ନ ଭାଷା ପାଇଁ phf ମ୍ୟାପ୍ ଫଙ୍କସନ୍ ସୃଷ୍ଟି କରନ୍ତୁ"#####,
    b"output_phf_all_in_one" => r#####"ସମସ୍ତ phf ମ୍ୟାପ୍ ଗୁଡିକୁ ଗୋଟିଏ ଫଙ୍କସନ୍ରେ ଏକତ୍ର କରନ୍ତୁ"#####,
    b"output_phf_without_map_name" => {
      r#####"ସାଧାରଣ ଷ୍ଟ୍ରିଂ କୀ ସହିତ phf ମ୍ୟାପ୍ (TupleKey ନୁହେଁ)"#####
    }
    b"output_ron" => r#####"RON ଫର୍ମାଟରେ ଷ୍ଟ୍ରିଂ ଏକ୍ସପୋର୍ଟ କରନ୍ତୁ"#####,
    b"suffix" => r#####""ହାଇଲାଇଟ-ମ୍ୟାପ୍" ର ନୂତନ ସଫିକ୍ସ"#####,
    b"syntax_name" => r#####"ସିଣ୍ଟାକ୍ସ ନାମ"#####,
    b"theme_name" => r#####"ଥିମ୍ ନାମ"#####,
    b"true_color" => r#####"24-ବିଟ୍ ପ୍ରକୃତ ରଙ୍ଗ"#####,
    b"visibility" => r#####"ଜେନେରେଟ ହୋଇଥିବା କୋଡ୍ ଦୃଶ୍ୟମାନତା"#####,
    _ => "",
  }
}
