pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"Ֆոնի ակտիվացում"#####,
    b"base_name" => r#####""Highlight-Map" հիմնական անվանում"#####,
    b"bincode_suffix" => r#####"bincode ֆայլի վերջածանց"#####,
    b"custom_syntax_set" => r#####"Շարահյուսության հատուկ հավաքածուի ֆայլ"#####,
    b"custom_theme_set" => r#####"Թեմայի հատուկ հավաքածուի ֆայլ"#####,
    b"display_config_dir" => r#####"Glossa-ի կոնֆիգուրացիայի պանակի ցուցադրում"#####,
    b"dsl_suffix" => r#####"DSL ֆայլի վերջածանց (լռելյայն ".dsl")"#####,
    b"exclude_languages" => {
      r#####"Սև ցուցակի ռեժիմ. Ցուցակում նշված լեզվի ID-ների անտեսում"#####
    }
    b"exclude_map_names" => {
      r#####"Ցուցակում նշված քարտեզների անունների անտեսում"#####
    }
    b"include_languages" => {
      r#####"Սպիտակ ցուցակի ռեժիմ. Միայն ցուցակում նշված լեզվի ID-ների նախաձեռնում"#####
    }
    b"include_map_names" => {
      r#####"Միայն ցուցակում նշված քարտեզների անունների նախաձեռնում"#####
    }
    b"input" => r#####"Լոկալիզացիայի ռեսուրսների աղբյուրային պանակ"#####,
    b"list_all_syntaxes" => {
      r#####"Ցուցադրել բոլոր շարահյուսությունների անուններն ու ընդարձակումները"#####
    }
    b"list_all_themes" => r#####"Ցուցադրել բոլոր թեմաների անունները"#####,
    b"mod_prefix" => r#####"mod ֆայլի նախածանց (լռելյայն "l10n_")"#####,
    b"outdir" => r#####"Ելքային պանակ"#####,
    b"output_bincode" => {
      r#####"Առանձին bincode ֆայլերի ստեղծում տարբեր լեզուների համար"#####
    }
    b"output_bincode_all_in_one" => {
      r#####"Բոլոր լեզուների bincode-ների միավորում մեկ ֆայլում"#####
    }
    b"output_locales_fn" => r#####"all_locales ֆունկցիայի արտահանում"#####,
    b"output_match_fn" => {
      r#####"Rust կոդի ֆայլերի ստեղծում match արտահայտություններով"#####
    }
    b"output_match_fn_all_in_one" => {
      r#####"Բոլոր տվյալների միավորում մեկ match ֆունկցիայում (տող)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"Match ֆունկցիա լեզվի անվամբ որպես բանալի"#####
    }
    b"output_match_fn_all_in_one_by_language_and_key" => {
      r#####"Match ֆունկցիա համակցված բանալիով (լեզու + map_key)"#####
    }
    b"output_match_fn_by_key" => {
      r#####"Օգտագործել միայն map_key որպես բանալի (առանց map_name-ի)"#####
    }
    b"output_phf" => {
      r#####"phf քարտեզի ֆունկցիաների ստեղծում տարբեր լեզուների համար"#####
    }
    b"output_phf_all_in_one" => {
      r#####"Բոլոր phf քարտեզների միավորում մեկ ֆունկցիայում"#####
    }
    b"output_phf_by_key" => {
      r#####"phf քարտեզ սովորական տողային բանալիով (ոչ TupleKey)"#####
    }
    b"output_ron" => r#####"Տողի արտահանում RON ձևաչափով"#####,
    b"suffix" => r#####""Highlight-Map" նոր վերջածանց"#####,
    b"syntax_name" => r#####"Շարահյուսության անվանում"#####,
    b"theme_name" => r#####"Թեմայի անվանում"#####,
    b"true_color" => r#####"24-բիթային իրական գույն"#####,
    b"visibility" => r#####"Ստեղծված կոդի տեսանելիություն"#####,
    _ => "",
  }
}
