pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"ጐልባቢ ምንቅርታ"#####,
    b"base_name" => r#####""ሃይላይት_ማፕ" መሰረታዊ ስም"#####,
    b"bincode_suffix" => r#####"ባንኮድ ፋይል ሰፊክስ"#####,
    b"custom_syntax_set" => r#####"ብፍላይ ሰንታክስ ስብስብ ፋይል"#####,
    b"custom_theme_set" => r#####"ብፍላይ ትስምርታ ስብስብ ፋይል"#####,
    b"display_config_dir" => r#####"ግሎሳ ኮንፍግ ዳይረክቶሪ ምርኢት"#####,
    b"dsl_suffix" => r#####"ዲ.ኤስ.ኤል ፋይል ሰፊክስ (ነባሪ ".dsl")"#####,
    b"exclude_languages" => r#####"ጸሊም ዝርዝር ሞድ: ኣብ ዝርዝር ዘለዉ ቋንቋ ኣይ.ዲ.ታት ኣይትጀምሩ"#####,
    b"exclude_map_names" => r#####"ኣብ ዝርዝር ዘለዉ ካርታ ስማት ኣይትጀምሩ"#####,
    b"include_languages" => {
      r#####"ነጻ ዝርዝር ሞድ: ኣብ ዝርዝር ዘለዉ ቋንቋ ኣይ.ዲ.ታት ጥራይ ምጅማር"#####
    }
    b"include_map_names" => r#####"ኣብ ዝርዝር ዘለዉ ካርታ ስማት ጥራይ ምጅማር"#####,
    b"input" => r#####"ናይ ሎካላይዜሽን ምንጪ ዳይረክቶሪ"#####,
    b"list_all_syntaxes" => r#####"ኩሎም ሰንታክስ ስማትን መወጻእታታትን ምርኢት"#####,
    b"list_all_themes" => r#####"ኩሎም ትስምርታ ስማት ምርኢት"#####,
    b"mod_prefix" => r#####"ሞድ ፋይል ፕሪፊክስ (ነባሪ "l10n_")"#####,
    b"outdir" => r#####"ውጽእቲ ዳይረክቶሪ"#####,
    b"output_bincode" => r#####"ንዝተፈላለየ ቋንቋታት ነጻ ባንኮድ ፋይላት ምፍጣር"#####,
    b"output_bincode_all_in_one" => r#####"ኩሎም ባንኮድታት ኣብ ሓደ ፋይል ምውጻእ"#####,
    b"output_locales_fn" => r#####"ኩሎም_ሎኬልስ ፋንክሽን ምውጻእ"#####,
    b"output_match_fn" => r#####"ንቋንቋታት ራስት ኮድ ምፍጣር (ማች ኤክስፕረሽን ዘለዎም ፋንክሽን)"#####,
    b"output_match_fn_all_in_one" => r#####"ኩሎም ዳታታት ኣብ ሓደ ማች ፋንክሽን ምውጻእ (ጽሑፍ)"#####,
    b"output_match_fn_all_in_one_by_language" => {
      r#####"ቋንቋ ስም ከም ቁልፊ ዘለዎ ማች ፋንክሽን"#####
    }
    b"output_match_fn_all_in_one_by_language_and_key" => {
      r#####"ቋንቋ ስም + ማፕ_ኪ ዝተተባህለ ማች ፋንክሽን"#####
    }
    b"output_match_fn_by_key" => r#####"ማፕ_ኪ ጥራይ ከም ቁልፊ ብምጥቃም (ማፕ_ነም የልቦን)"#####,
    b"output_phf" => r#####"ንቋንቋታት ፂም ፂም ፂ.ኤች.ኤፍ መፍትሕታት ምፍጣር"#####,
    b"output_phf_all_in_one" => r#####"ኩሎም ፂ.ኤች.ኤፍ መፍትሕታት ኣብ ሓደ ፋንክሽን ምውጻእ"#####,
    b"output_phf_by_key" => {
      r#####"ብተለቀቅቲ ጽሑፍ ቁልፍታት ዘለዎ ፂ.ኤች.ኤፍ መፍትሕ (ነቲ ቱፕልኪ ዘይኮነ)"#####
    }
    b"output_ron" => r#####"ጽሑፍ ብኣር.ኦ.ኤን ፎርማት ምውጻእ"#####,
    b"suffix" => r#####""ሃይላይት_ማፕ" ሓድሽ ሰፊክስ"#####,
    b"syntax_name" => r#####"ሰንታክስ ስም"#####,
    b"theme_name" => r#####"ትስምርታ ስም"#####,
    b"true_color" => r#####"24-ቢት ናይ ሓቂ ሕብሪ"#####,
    b"visibility" => r#####"ዝተፈጥረ ኮድ እዚ ርአይታ"#####,
    _ => "",
  }
}
