pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"പശ്ചാത്തലം പ്രവർത്തനക്ഷമമാക്കുക"#####,
    b"base_name" => r#####"ഹൈലൈറ്റ് മാപ്പിന്റെ അടിസ്ഥാന പേര്"#####,
    b"bincode_suffix" => r#####"ബിന്‍കോഡ് ഫയൽ സഫിക്സ്"#####,
    b"custom_syntax_set" => r#####"കസ്റ്റം സിന്റാക്സ് സെറ്റ് ഫയൽ"#####,
    b"custom_theme_set" => r#####"കസ്റ്റം തീം സെറ്റ് ഫയൽ"#####,
    b"display_config_dir" => r#####"ഗ്ലോസയുടെ കോൺഫിഗ് ഡയറക്ടറി പ്രദർശിപ്പിക്കുക"#####,
    b"dsl_suffix" => r#####"ഡിഎസ്എൽ ഫയൽ സഫിക്സ് (ഡിഫോൾട്ട് ".dsl")"#####,
    b"exclude_languages" => r#####"ബ്ലാക്ക്ലിസ്റ്റ് മോഡ്: ലിസ്റ്റിലെ ഭാഷാ ഐഡികൾ സജ്ജമാക്കരുത്"#####,
    b"exclude_map_names" => r#####"ലിസ്റ്റിലെ മാപ്പ് പേരുകൾ സജ്ജമാക്കരുത്"#####,
    b"include_languages" => {
      r#####"വൈറ്റ്ലിസ്റ്റ് മോഡ്: ലിസ്റ്റിലെ ഭാഷാ ഐഡികൾ മാത്രം സജ്ജമാക്കുക"#####
    }
    b"include_map_names" => r#####"ലിസ്റ്റിലെ മാപ്പ് പേരുകൾ മാത്രം സജ്ജമാക്കുക"#####,
    b"input" => r#####"ലോക്കലൈസേഷൻ വിഭവങ്ങളുടെ സോഴ്‌സ് ഡയറക്ടറി"#####,
    b"list_all_syntaxes" => r#####"എല്ലാ സിന്റാക്സ് പേരുകളും എക്സ്റ്റൻഷനുകളും പ്രദർശിപ്പിക്കുക"#####,
    b"list_all_themes" => r#####"എല്ലാ തീം പേരുകളും പ്രദർശിപ്പിക്കുക"#####,
    b"mod_prefix" => r#####"മോഡ് ഫയൽ പ്രിഫിക്സ് (ഡിഫോൾട്ട് "l10n_")"#####,
    b"outdir" => r#####"ഔട്പുട്ട് ഡയറക്ടറി"#####,
    b"output_bincode" => r#####"വ്യത്യസ്ത ഭാഷകൾക്ക് വെവ്വേറെ ബിന്‍കോഡ് ഫയലുകൾ സൃഷ്ടിക്കുക"#####,
    b"output_bincode_all_in_one" => {
      r#####"എല്ലാ ഭാഷകളുടെയും ബിന്‍കോഡ് ഒരു ഫയലിലേക്ക് എക്സ്പോർട്ട് ചെയ്യുക"#####
    }
    b"output_locales_fn" => r#####"ഓൾ_ലോക്കേൽസ് ഫംഗ്ഷൻ എക്സ്പോർട്ട് ചെയ്യുക"#####,
    b"output_match_fn" => r#####"മാച്ച് എക്സ്പ്രഷൻ ഫംഗ്ഷനുകളുള്ള റസ്റ്റ് ഫയലുകൾ സൃഷ്ടിക്കുക"#####,
    b"output_match_fn_all_in_one" => {
      r#####"എല്ലാ ഡാറ്റയും ഒരു മാച്ച് ഫംഗ്ഷനായി എക്സ്പോർട്ട് ചെയ്യുക (സ്ട്രിംഗ്)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"ഭാഷാ പേര് കീ ആയി ഉള്ള മാച്ച് ഫംഗ്ഷൻ"#####
    }
    b"output_match_fn_all_in_one_by_language_and_key" => {
      r#####"കോംബിനേഷൻ കീ (ഭാഷ+മാപ്പ്_കീ) ഉള്ള മാച്ച് ഫംഗ്ഷൻ"#####
    }
    b"output_match_fn_by_key" => {
      r#####"മാപ്പ്_കീ മാത്രം കീ ആയി ഉപയോഗിക്കുക (മാപ്പ്_നേം ഇല്ല)"#####
    }
    b"output_phf" => r#####"വ്യത്യസ്ത ഭാഷകൾക്ക് പിഎച്ച്എഫ് മാപ്പ് ഫംഗ്ഷനുകൾ സൃഷ്ടിക്കുക"#####,
    b"output_phf_all_in_one" => {
      r#####"എല്ലാ പിഎച്ച്എഫ് മാപ്പുകളും ഒരു ഫംഗ്ഷനിലേക്ക് യോജിപ്പിക്കുക"#####
    }
    b"output_phf_by_key" => {
      r#####"സാധാരണ സ്ട്രിംഗ് കീകളുള്ള പിഎച്ച്എഫ് മാപ്പ് (ട്യൂപ്പിൾകീ അല്ല)"#####
    }
    b"output_ron" => r#####"RON ഫോർമാറ്റിൽ സ്ട്രിംഗ് എക്സ്പോർട്ട് ചെയ്യുക"#####,
    b"suffix" => r#####"പുതിയ ഹൈലൈറ്റ് മാപ്പിന്റെ സഫിക്സ്"#####,
    b"syntax_name" => r#####"സിന്റാക്സ് പേര്"#####,
    b"theme_name" => r#####"തീം പേര്"#####,
    b"true_color" => r#####"24-ബിറ്റ് റിയൽ കളർ"#####,
    b"visibility" => r#####"സൃഷ്ടിച്ച കോഡിന്റെ ദൃശ്യത"#####,
    _ => "",
  }
}
