pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"पृष्ठभूमि सक्रिय गर्नुहोस्"#####,
    b"base_name" => r#####"हाइलाइट म्यापको आधार नाम"#####,
    b"bincode_suffix" => r#####"बिन्कोड फाइल सफिक्स"#####,
    b"custom_syntax_set" => r#####"अनुकूल वाक्यरचना सेट फाइल"#####,
    b"custom_theme_set" => r#####"अनुकूल विषय सेट फाइल"#####,
    b"display_config_dir" => r#####"ग्लोसाको कन्फिगरेसन डाइरेक्टरी देखाउनुहोस्"#####,
    b"dsl_suffix" => r#####"DSL फाइल सफिक्स (डिफल्ट ".dsl")"#####,
    b"exclude_languages" => {
      r#####"कालोसूची मोड: सूचीका भाषा ID लाई निष्क्रिय गर्नुहोस्"#####
    }
    b"exclude_map_names" => r#####"सूचीका म्याप नामहरू निष्क्रिय गर्नुहोस्"#####,
    b"include_languages" => r#####"श्वेतसूची मोड: सूचीमा भाषा ID मात्र सक्रिय गर्नुहोस्"#####,
    b"include_map_names" => r#####"सूचीमा म्याप नाम मात्र सक्रिय गर्नुहोस्"#####,
    b"input" => r#####"स्थानीयकरण स्रोतहरूको मूल डाइरेक्टरी"#####,
    b"list_all_syntaxes" => r#####"सबै वाक्यरचना नाम र विस्तारहरू देखाउनुहोस्"#####,
    b"list_all_themes" => r#####"सबै विषय नामहरू देखाउनुहोस्"#####,
    b"mod_prefix" => r#####"मोड फाइल उपसर्ग (डिफल्ट "l10n_")"#####,
    b"outdir" => r#####"आउटपुट डाइरेक्टरी"#####,
    b"output_bincode" => {
      r#####"विभिन्न भाषाहरूका लागि अलग बिन्कोड फाइलहरू सिर्जना गर्नुहोस्"#####
    }
    b"output_bincode_all_in_one" => {
      r#####"सबै भाषाका बिन्कोडहरू एकै फाइलमा निर्यात गर्नुहोस्"#####
    }
    b"output_locales_fn" => r#####"all_locales प्रकार्य निर्यात गर्नुहोस्"#####,
    b"output_match_fn" => {
      r#####"म्याच एक्सप्रेसन समावेश गर्ने रस्ट फाइलहरू सिर्जना गर्नुहोस्"#####
    }
    b"output_match_fn_all_in_one" => {
      r#####"सबै डाटा एक म्याच प्रकार्यमा निर्यात गर्नुहोस् (स्ट्रिङ)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"भाषा नाम कुञ्जी भएको एकीकृत म्याच प्रकार्य"#####
    }
    b"output_match_fn_all_in_one_by_language_and_key" => {
      r#####"संयुक्त कुञ्जी (भाषा+म्याप_की) भएको म्याच प्रकार्य"#####
    }
    b"output_match_fn_by_key" => {
      r#####"म्याप_की मात्र कुञ्जीको रूपमा प्रयोग गर्नुहोस् (म्याप_नेम समावेश छैन)"#####
    }
    b"output_phf" => r#####"भाषा अनुसार फेज प्रकार्यहरू सिर्जना गर्नुहोस्"#####,
    b"output_phf_all_in_one" => r#####"सबै फेज म्यापहरू एक प्रकार्यमा समेट्नुहोस्"#####,
    b"output_phf_by_key" => r#####"साधारण स्ट्रिङ कुञ्जी भएको फेज म्याप (टपलकी होइन)"#####,
    b"output_ron" => r#####"RON ढाँचामा स्ट्रिङ निर्यात गर्नुहोस्"#####,
    b"suffix" => r#####"नयाँ हाइलाइट म्यापको सफिक्स"#####,
    b"syntax_name" => r#####"वाक्यरचना नाम"#####,
    b"theme_name" => r#####"विषय नाम"#####,
    b"true_color" => r#####"२४-बिट वास्तविक रङ"#####,
    b"visibility" => r#####"जनरेट गरिएको कोडको दृश्यता"#####,
    _ => "",
  }
}
