pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"ব্যাকগ্রাউন্ড সক্রিয় করুন"#####,
    b"base_name" => r#####""হাইলাইট-ম্যাপ" এর বেস নাম"#####,
    b"bincode_suffix" => r#####"bincode ফাইলের সাফিক্স"#####,
    b"custom_syntax_set" => r#####"কাস্টম সিনট্যাক্স সেট ফাইল"#####,
    b"custom_theme_set" => r#####"কাস্টম থিম সেট ফাইল"#####,
    b"display_config_dir" => r#####"Glossa এর কনফিগ ডিরেক্টরি দেখান"#####,
    b"dsl_suffix" => r#####"DSL ফাইলের সাফিক্স (ডিফল্ট ".dsl")"#####,
    b"exclude_languages" => {
      r#####"ব্ল্যাকলিস্ট মোড: তালিকাভুক্ত ভাষা ID গুলি ইনিশিয়ালাইজ করবেন না"#####
    }
    b"exclude_map_names" => r#####"তালিকাভুক্ত ম্যাপ নামগুলি ইনিশিয়ালাইজ করবেন না"#####,
    b"include_languages" => {
      r#####"হোয়াইটলিস্ট মোড: তালিকাভুক্ত ভাষা ID গুলি শুধুমাত্র ইনিশিয়ালাইজ করুন"#####
    }
    b"include_map_names" => r#####"তালিকাভুক্ত ম্যাপ নামগুলি শুধুমাত্র ইনিশিয়ালাইজ করুন"#####,
    b"input" => r#####"লোকালাইজেশন রিসোর্সের সোর্স ডিরেক্টরি"#####,
    b"list_all_syntaxes" => r#####"সমস্ত সিনট্যাক্স নাম এবং এক্সটেনশন দেখান"#####,
    b"list_all_themes" => r#####"সমস্ত থিমের নাম দেখান"#####,
    b"mod_prefix" => r#####"mod ফাইলের প্রিফিক্স (ডিফল্ট "l10n_")"#####,
    b"outdir" => r#####"আউটপুট ডিরেক্টরি"#####,
    b"output_bincode" => r#####"বিভিন্ন ভাষার জন্য স্বতন্ত্র bincode ফাইল জেনারেট করুন"#####,
    b"output_bincode_all_in_one" => {
      r#####"সকল ভাষার bincode একটি ফাইলে এক্সপোর্ট করুন"#####
    }
    b"output_locales_fn" => r#####"all_locales ফাংশন এক্সপোর্ট করুন"#####,
    b"output_match_fn" => {
      r#####"ম্যাচ এক্সপ্রেশন সহ Rust কোড ফাইল জেনারেট করুন (প্রতিটি ভাষার জন্য)"#####
    }
    b"output_match_fn_all_in_one" => {
      r#####"সমস্ত ডেটা একটি ম্যাচ ফাংশনে এক্সপোর্ট করুন (স্ট্রিং)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"ভাষার নামকে কী হিসেবে ব্যবহার করে ম্যাচ ফাংশন"#####
    }
    b"output_match_fn_all_in_one_without_map_name" => {
      r#####"কম্বাইন্ড কী (ভাষার নাম + map_key) সহ ম্যাচ ফাংশন"#####
    }
    b"output_match_fn_without_map_name" => {
      r#####"শুধুমাত্র map_key কে কী হিসেবে ব্যবহার করুন (map_name বাদ দিন)"#####
    }
    b"output_phf" => r#####"প্রতিটি ভাষার জন্য আলাদা phf ম্যাপ ফাংশন জেনারেট করুন"#####,
    b"output_phf_all_in_one" => r#####"সমস্ত phf ম্যাপ একটি ফাংশনে একত্রিত করুন"#####,
    b"output_phf_without_map_name" => {
      r#####"সাধারণ স্ট্রিং কী সহ phf ম্যাপ (TupleKey নয়)"#####
    }
    b"output_ron" => r#####"RON ফরম্যাটে স্ট্রিং এক্সপোর্ট করুন"#####,
    b"suffix" => r#####""হাইলাইট-ম্যাপ" এর নতুন সাফিক্স"#####,
    b"syntax_name" => r#####"সিনট্যাক্সের নাম"#####,
    b"theme_name" => r#####"থিমের নাম"#####,
    b"true_color" => r#####"24-বিট সত্যিকারের রঙ"#####,
    b"visibility" => r#####"জেনারেট করা কোডের দৃশ্যমানতা"#####,
    _ => "",
  }
}
