pub(crate) const fn map(key: &[u8]) -> &'static str {
  match key {
    b"background" => r#####"אקטיווירן הינטערגרונט"#####,
    b"base_name" => r#####"באַזע נאָמען פֿון "Highlight-Map""#####,
    b"bincode_suffix" => r#####"בינקאָדע טעקע סופפיקס"#####,
    b"custom_syntax_set" => r#####"מנהג סינטאַקס סעט טעקע"#####,
    b"custom_theme_set" => r#####"מנהג טעמע סעט טעקע"#####,
    b"display_config_dir" => r#####"ווייַזן glossa קאָנפיג דירעקטאָרי"#####,
    b"dsl_suffix" => r#####"דסל טעקע סופפיקס (דיפאָלט ".dsl")"#####,
    b"exclude_languages" => {
      r#####"שוואַרץ ליסטע מאָדע: ניט איניטיאַליזירן שפּראַך ID"#####
    }
    b"exclude_map_names" => r#####"ניט איניטיאַליזירן מאַפּע נעמען אין ליסטע"#####,
    b"include_languages" => {
      r#####"ווײַס ליסטע מאָדע: נאָר איניטיאַליזירן שפּראַך ID אין ליסטע"#####
    }
    b"include_map_names" => r#####"נאָר איניטיאַליזירן מאַפּע נעמען אין ליסטע"#####,
    b"input" => r#####"צענטראַל דירעקטאָרי פֿון לאָוקאַליזאַציע רעסורסן"#####,
    b"list_all_syntaxes" => r#####"ווייַזן אַלע סינטאַקס נעמען מיט עקסטענשאַנז"#####,
    b"list_all_themes" => r#####"ווייַזן אַלע טעמע נעמען"#####,
    b"mod_prefix" => r#####"מאָד טעקע פּרעפיקס (דיפאָלט "l10n_")"#####,
    b"outdir" => r#####"אויסגאַבע דירעקטאָרי"#####,
    b"output_bincode" => {
      r#####"שאַפֿן סעפּאַראַטע בינקאָדע טעקעס פֿאַר פאַרשידענע שפּראַכן"#####
    }
    b"output_bincode_all_in_one" => {
      r#####"אַרויסגעבן אַלע בינקאָדעס אין איין טעקע"#####
    }
    b"output_locales_fn" => r#####"אַרויסגעבן all_locales פֿונקציע"#####,
    b"output_match_fn" => {
      r#####"שאַפֿן ראַסט טעקעס מיט מאַטש פֿונקציע פֿאַר יעדער שפּראַך"#####
    }
    b"output_match_fn_all_in_one" => {
      r#####"קאַנסאַלידירן אַלע דאַטן אין איין מאַטש פֿונקציע (שטריקל)"#####
    }
    b"output_match_fn_all_in_one_by_language" => {
      r#####"מאַטש פֿונקציע מיט שפּראַך נאָמען שליסל"#####
    }
    b"output_match_fn_all_in_one_by_language_and_key" => {
      r#####"מאַטש פֿונקציע מיט קאָמבינירטן שליסל (שפּראַך+map_key)"#####
    }
    b"output_match_fn_by_key" => {
      r#####"ניצן בלויז map_key ווי שליסל (אָן map_name)"#####
    }
    b"output_phf" => r#####"שאַפֿן סעפּאַראַטע פֿף מאַפּעס פֿאַר שפּראַכן"#####,
    b"output_phf_all_in_one" => {
      r#####"צונויפֿנעמען אַלע פֿף מאַפּעס אין איין פֿונקציע"#####
    }
    b"output_phf_by_key" => {
      r#####"פֿף מאַפּעס מיט נאָרמאַלע שטריקל שליסלען (ניט TupleKey)"#####
    }
    b"output_ron" => r#####"אַרויסגעבן שטריקל אין RAN פֿאָרמאַט"#####,
    b"suffix" => r#####"נייַ סופפיקס פֿון "Highlight-Map""#####,
    b"syntax_name" => r#####"סינטאַקס נאָמען"#####,
    b"theme_name" => r#####"טעמע נאָמען"#####,
    b"true_color" => r#####"24-ביט אמת קאָליר"#####,
    b"visibility" => r#####"דערזעאונג פון דזשענערירטע קאָד"#####,
    _ => "",
  }
}
